export const tips = {
  types: {
    maps: {
      code: 'maps',
      name: 'картографические пространственные данные и материалы',
      desc: 'Это любые карты и планы (в том числе планшеты).'
    },
    survey: {
      code: 'survey',
      name: 'геодезические пространственные данные и материалы',
      desc: 'Сведения о пунктах геодезических сетей - \
      координаты, высоты, абрисы и кроки.'
    },
    ers: {
      code: 'ers',
      name: 'материалы и данные дистанционного зондирования Земли',
      desc: 'Среди материалов ДЗЗ в Фонде представлены \
      спутниковые снимки, выполняемые российскими космическими аппаратами, \
      а также ортофотопланы, изготавливаемые нами самостоятельно.'
    },
    reports: {
      code: 'reports',
      name: 'справочные материалы',
      desc: 'Разного рода технические отчеты. Например, по инженерным \
      изысканиям и исполнительным съемкам.'
    },
    keys: {
      code: 'keys',
      name: 'параметры (ключи) перехода',
      desc: 'Поскольку исторически дежурные планы населенных пунктов \
      создавались в условных системах координат, для их привязки \
      мы рассчитываем параметры перехода от этих условных систем \
      к МСК Астраханской области.'
    },
  }
};
