import Link from 'next/link'
import styles from './footer.module.css'

export const Footer = () => {
  return (
    <footer className={styles.footer}>
      <div className={styles.container}>
        <nav className={styles.content}>
            <ul className={styles.content_list}>
              <li><Link href='/'>Главная</Link></li>
              <li><Link href='/about'>Кто мы</Link></li>
              <li><Link href='/work'>Что мы делаем</Link></li>
              <li><Link href='/news'>Новости</Link></li>
              <li><Link href='/blog'>Статьи</Link></li>
              <li><Link href='/docs'>Документы</Link></li>
            </ul>
        </nav>
        <div className={styles.links}>
          <a target="_blank" href="https://augi.astrobl.ru/">Министерство имущественных и градостроительных отношений Астраханской области</a>
          <a target="_blank" href="https://astrobl.ru/">Администрация Губернатора Астраханской области</a>
          <a target="_blank" href="https://cgkipd.ru/fsdf/">Федеральный фонд пространственных данных</a>
        </div>
        <div className={styles.contacts}>
          <p className={styles.text}>414000, г. Астрахань, ул. Набережная 1 мая, 75 / ул. Шаумяна, 48</p>
          <a href="mailto:gisaogp@mail.ru">gisaogp@mail.ru</a>
          <p className={styles.text}>8 (8512) 66-74-00</p>
          <p className={styles.text}>8 (8512) 66-74-60</p>
          <div className={styles.social}>
            <a href='https://vk.com/cpapr' target='_blank'>
              <svg width="20" height="20" viewBox="0 0 101 100" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clipPath="url(#clip0_2_2)">
                  <path fillRule="evenodd" clipRule="evenodd" d="M7.52944 7.02944C0.5 14.0589 0.5 25.3726 0.5 48V52C0.5 74.6274 0.5 85.9411 7.52944 92.9706C14.5589 100 25.8726 100 48.5 100H52.5C75.1274 100 86.4411 100 93.4706 92.9706C100.5 85.9411 100.5 74.6274 100.5 52V48C100.5 25.3726 100.5 14.0589 93.4706 7.02944C86.4411 0 75.1274 0 52.5 0H48.5C25.8726 0 14.5589 0 7.52944 7.02944ZM17.3752 30.4169C17.9168 56.4169 30.9167 72.0418 53.7084 72.0418H55.0003V57.1668C63.3753 58.0001 69.7082 64.1252 72.2498 72.0418H84.0835C80.8335 60.2085 72.2914 53.6668 66.9581 51.1668C72.2914 48.0835 79.7915 40.5835 81.5831 30.4169H70.8328C68.4995 38.6669 61.5836 46.1668 55.0003 46.8751V30.4169H44.2499V59.2501C37.5833 57.5835 29.1668 49.5002 28.7918 30.4169H17.3752Z" fill="white"/>
                </g>
                <defs>
                  <clipPath id="clip0_2_2">
                    <rect width="100" height="100" fill="white" transform="translate(0.5)"/>
                  </clipPath>
                </defs>
              </svg>
            </a>
            <a href='https://ok.ru/group/70000002510438' target='_blank'>
              <svg width="20" height="20" viewBox="0 0 385.404 383.438" xmlns="http://www.w3.org/2000/svg">
                <path d="M56.11 0C25.12 0 0 25.12 0 56.11v271.216c0 30.99 25.12 56.111 56.11 56.111h273.183c30.989 0 56.111-25.122 56.111-56.11V56.108C385.404 25.121 360.282 0 329.293 0Zm136.374 55.91c38.593 0 69.88 31.287 69.88 69.88 0 38.592-31.287 69.88-69.88 69.88-38.593 0-69.877-31.288-69.877-69.88 0-38.593 31.284-69.88 69.877-69.88zm0 40.994c-15.953 0-28.884 12.932-28.884 28.885 0 15.953 12.931 28.889 28.884 28.889 15.953 0 28.887-12.936 28.887-28.889s-12.934-28.885-28.887-28.885zm-59.115 100.95a18.915 18.915 0 0 1 10.318 4.113c.173.14 18.43 13.855 47.848 13.875 29.42-.02 47.3-13.735 47.473-13.875 8.188-6.564 20.145-5.249 26.709 2.937 6.565 8.187 5.25 20.144-2.936 26.71-.887.71-17.652 13.958-45.627 19.657l42.229 41.852c7.426 7.414 7.433 19.443.02 26.87-7.415 7.424-19.442 7.437-26.87.02l-40.996-39.921-37.234 39.664a18.946 18.946 0 0 1-13.68 5.812c-4.748 0-9.5-1.767-13.187-5.322-7.554-7.284-7.773-19.311-.489-26.865l40.08-41.889c-28.759-5.565-46.214-19.158-47.113-19.879-8.186-6.565-9.5-18.522-2.936-26.709 4.103-5.116 10.312-7.548 16.391-7.05z" style={{fill:'#fff',fillOpacity:1}}/>
                <path fill="#fff" d="M191.536 215.842c-.047 0 .046 0 0 .002-.046-.001.047-.002 0-.002z"/>
              </svg>
            </a>
          </div>
        </div>
      </div>
    </footer>
  )
}