/* Components */

export default function IndexPage() {
  return (
  <>
  <div>
    <h2>ГОСУДАРСТВЕННОЕ АВТОНОМНОЕ УЧРЕЖДЕНИЕ АСТРАХАНСКЙ ОБЛАСТИ</h2>
    <div>
      <h1>ЦЕНТР</h1>
      <div>
        <h2>ПРОСТРАНСТВЕННОЙ АНАЛИТИКИ</h2>
        <h2>И РАЗВИТИЯ ТЕРРИТОРИЙ</h2>
      </div>
    </div>
  </div>
    <p>
      Визитка организации
    </p>
  </>)
}

export const metadata = {
  title: {
    default: 'ГАУ АО "ЦПАРТ"',
    template: 'ГАУ АО "ЦПАРТ" | $s'
  },
  description: 'Государственное автономное учреждение Астраханской области "Центр пространственной аналитики и развития территорий". Официальный ресурс'
}
